Repository: CofficLab/Lumi
Catalog: Plugins/PortManagerPlugin/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk, zh_tw

# Are you sure you want to kill process %@ (PID: %@)?
source: Are you sure you want to kill process %1$@ (PID: %2$@)?
zh_hans: 确定要终止进程 %@（PID：%@）吗？
zh_hk: 确定要终止进程 %@（PID：%@）吗？
zh_tw: 确定要终止进程 %@（PID：%@）吗？

source: Are you sure you want to kill process %1$@ (PID: %2$@)?
zh_hans: 确定要结束进程 %1$@ (PID: %2$@) 吗？
zh_hk: 確定要結束進程 %1$@ (PID: %2$@) 吗？
zh_tw: 確定要結束進程 %1$@ (PID: %2$@) 吗？

source: Basic Operations
zh_hans: 基本操作
zh_hk: 基本操作
zh_tw: 基本操作

source: Cancel
zh_hans: 取消
zh_hk: 取消
zh_tw: 取消

source: Click Refresh to rescan the ports at any time.
zh_hans: 随时点击「刷新」重新扫描端口。
zh_hk: 隨時點擊「重新整理」重新掃描連接埠。
zh_tw: 隨時點擊「重新整理」重新掃描連接埠。

source: Error
zh_hans: 错误
zh_hk: 錯誤
zh_tw: 錯誤

source: Failed to kill process: %@
zh_hans: 结束进程失败：%@
zh_hk: 結束進程失敗：%@
zh_tw: 結束進程失敗：%@

source: Failed to scan ports: %@
zh_hans: 扫描端口失败：%@
zh_hk: 掃描端口失敗：%@
zh_tw: 掃描連接埠失敗：%@

source: Figure 1: Interface layout
zh_hans: 图 1 界面布局
zh_hk: 圖 1 介面說明
zh_tw: 圖 1 介面說明

source: Interface
zh_hans: 界面说明
zh_hk: 介面說明
zh_tw: 介面說明

source: Kill Process
zh_hans: 结束进程
zh_hk: 結束進程
zh_tw: 結束進程

source: Loading Ports
zh_hans: 加载端口...
zh_hk: 載入連接埠...
zh_tw: 載入連接埠...

source: No Listening Ports
zh_hans: 没有监听中的端口
zh_hk: 没有監聽中的端口
zh_tw: 没有監聽中的連接埠

source: No listening ports found.
zh_hans: 未发现监听中的端口。
zh_hk: 未發現監聽中的端口。
zh_tw: 未發現監聽中的連接埠。

source: Notes
zh_hans: 注意事项
zh_hk: 注意事項
zh_tw: 注意事項

source: OK
zh_hans: 确定
zh_hk: 確定
zh_tw: 確定

source: Only ports in the listening state are listed.
zh_hans: 列表仅显示处于监听状态的端口。
zh_hk: 列表僅顯示處於監聽狀態的連接埠。
zh_tw: 列表僅顯示處於監聽狀態的連接埠。

source: Open the Port Manager tab; the port list is scanned automatically.
zh_hans: 打开端口管理标签页,端口列表会自动扫描。
zh_hk: 開啟連接埠管理標籤頁,連接埠列表會自動掃描。
zh_tw: 開啟連接埠管理標籤頁,連接埠列表會自動掃描。

source: Overview
zh_hans: 概述
zh_hk: 概述
zh_tw: 概述

source: Port List
zh_hans: 端口列表
zh_hk: 連接埠列表
zh_tw: 連接埠列表

source: Port list: one card per listening port, showing the port number, process name, address, PID badge, and user, with a terminate button on the right.
zh_hans: 「端口列表」:每个监听端口一张卡片,显示端口号、进程名、地址、PID 徽章和用户,右侧为结束进程按钮。
zh_hk: 「連接埠列表」:每個監聽連接埠一張卡片,顯示連接埠號、程序名稱、位址、PID 徽章和使用者,右側為結束程序按鈕。
zh_tw: 「連接埠列表」:每個監聽連接埠一張卡片,顯示連接埠號、程序名稱、位址、PID 徽章和使用者,右側為結束程序按鈕。

source: Port Manager
zh_hans: 端口管理
zh_hk: 端口管理
zh_tw: 連接埠管理

source: Refresh
zh_hans: 刷新
zh_hk: 重新整理
zh_tw: 重新整理

source: Search port, PID, or process name
zh_hans: 搜索端口、PID 或进程名
zh_hk: 搜尋端口、PID 或進程名
zh_tw: 搜尋連接埠、PID 或進程名

source: Terminating a process may lose its unsaved data; check before confirming.
zh_hans: 结束进程可能丢失未保存的数据,确认前请先检查。
zh_hk: 結束程序可能遺失未儲存的資料,確認前請先檢查。
zh_tw: 結束程序可能遺失未儲存的資料,確認前請先檢查。

source: This action will force terminate the process, which may lead to data loss.
zh_hans: 此操作将强制终止进程，可能会导致数据丢失。
zh_hk: 此操作将强制终止進程，可能会导致数据丢失。
zh_tw: 此操作将强制终止進程，可能会导致数据丢失。

source: This manual covers the interface and basic operations of the Port Manager: scanning local listening ports, filtering the list, and terminating processes.
zh_hans: 本手册介绍端口管理的界面与基本操作:扫描本机监听端口、筛选列表,以及结束进程。
zh_hk: 本手冊介紹連接埠管理的介面與基本操作:掃描本機監聽連接埠、篩選列表,以及結束程序。
zh_tw: 本手冊介紹連接埠管理的介面與基本操作:掃描本機監聽連接埠、篩選列表,以及結束程序。

source: To terminate a process, click the button on the right of its card and confirm in the dialog.
zh_hans: 要结束某个进程,点击其卡片右侧的按钮,并在弹出的对话框中确认。
zh_hk: 要結束某個程序,點擊其卡片右側的按鈕,並在彈出的對話框中確認。
zh_tw: 要結束某個程序,點擊其卡片右側的按鈕,並在彈出的對話框中確認。

source: Toolbar
zh_hans: 工具栏
zh_hk: 工具列
zh_tw: 工具列

source: Toolbar: the search field and the Refresh button.
zh_hans: 工具栏:搜索框和「刷新」按钮。
zh_hk: 工具列:搜尋框和「重新整理」按鈕。
zh_tw: 工具列:搜尋框和「重新整理」按鈕。

source: Type in the search field to filter the list by port number, PID, or process name.
zh_hans: 在搜索框中输入,按端口号、PID 或进程名筛选列表。
zh_hk: 在搜尋框中輸入,按連接埠號、PID 或程序名稱篩選列表。
zh_tw: 在搜尋框中輸入,按連接埠號、PID 或程序名稱篩選列表。

source: Unknown error
zh_hans: 未知错误
zh_hk: 未知錯誤
zh_tw: 未知錯誤

source: User Manual
zh_hans: 使用手册
zh_hk: 使用手冊
zh_tw: 使用手冊

source: When no listening ports are found, an empty state is shown in place of the list.
zh_hans: 未发现监听端口时,列表位置显示空状态。
zh_hk: 未發現監聽連接埠時,列表位置顯示空狀態。
zh_tw: 未發現監聽連接埠時,列表位置顯示空狀態。
